

/** Отдел продаж Опт, Ecomerce
 * Юлия Воронцова ТП торговый представитель
 */

export class Ecomerce {

    /** проверка Автоматических Почтовых Заказов покупателей
     * Клиент присылает заказ на почту
     * Проверяю карточки и цены в автоматически загруженном заказе покупателя в 1c
     */
    проверкаАвтоматическихПочтовыхЗаказовПокупателей() { }

    /**  настройка Автоматических Почтовых Заказов покупателей
     * Я настраиваю в 1с определенные настройки и согласно им в 1с загружается заказ 
     */
    настройкаАвтоматическихПочтовыхЗаказов() { }

    /** оформление- Телефонных Заказов
     * Вручную вношу заказы в программу
     */
    оформлениеТелефонныхЗаказов() { }

    /** оформление Заказов Из Месенджеров
     * Вручную вношу заказы в программу
     */
    оформлениеЗаказовИзМесенджеров() { }

    /** настройка Рассылки Прайс-Листа
     * Прайс лист рассылается 3 раза в день автоматически
     * Я настраиваю рассылку для созданных контрагентов
     * Прайс лист выгружается на указанную почту
     * Фильтруются группы товаров которые не
     * т возможности продавать через моих клиентов. Фильтр назначается в устной форме. 
     * Выгржаемые колонки 1с программер говорит как называются реквизиты для выгрузки
     * Карточку копирую поэтому тип цены не ставлю
     * Я:всем выгружается прайс с отсрочкой платежа
     * 
     */
    настройкаРассылкиПрайсЛиста() { }

    /** В этом файле торг преды оставляют заказ когда им что то нужно. Товар которого нет на остатке и нужно что бы не забыли его включить
     * новый продукт 
     * увеличенная потребность относительно стандартных продаж
     */
    оформитьФайлДляПланаЗакупокExcelПриходыЗаказы() {
    }

}
