import { Injectable } from '@nestjs/common';
import { Бухгалтерия } from './accaunting.service'



/** Бухгалтерия AccauntingDepartmentService */
@Injectable()
export class НадеждаБлажина extends Бухгалтерия {
    // приходТовара
    //импорт реализации в бух базу 

    /** 1 */
    оформитьПоступлениеТоваров() {
        super.оформитьПоступлениеТоваров()
    }
    /** 2 */
    оформлениеДопРасходовПоИмпортуТоваров() {
        super.оформлениеДопРасходовПоИмпортуТоваров()
    }
    /** 3 */
    оформитьПеремещениеТовара() {
        super.оформитьПеремещениеТовара()
    }

}