
import { Buhgalteria } from './бухгалтерия.service'



/** Бухгалтерия AccauntingDepartmentService */

export class SidirivichElena extends Buhgalteria {

    отразитьВалютОперациюППВВДок1сБухИзКлиентБанка() {
        super.отразитьВалютОперациюППВВДок1сБухИзКлиентБанка()
    }
    отразитьВалютОперациюППИВДок1сБухИзКлиентБанка() {
        super.отразитьВалютОперациюППИВДок1сБухИзКлиентБанка()
    }
    отразитьОперациюКонвертациюВалютыСнаб() {
        super.отразитьОперациюКонвертациюВалютыСнаб()
    }
    отразитьОперациюКонвертациюВалютыБоникс() {
        super.отразитьОперациюКонвертациюВалютыБоникс()
    }

    /** 1 */
    отразитьОперациюКомандировкаСтороннихПеревозчиков() {
        super.отразитьОперациюКомандировкаСтороннихПеревозчиков
    }
    /** 2 */
    выставлениеДолгаКонтрагенту() {
        super.выставлениеДолгаКонтрагенту()
    }
    /** 2 */
    анализДолгаКонтрагентов() {
        super.анализДолгаКонтрагентов()
    }
    /** 3 */
    передачаОборудованияВоВременноеПользование() {
        super.передачаОборудованияВоВременноеПользование()
    }
    /** 4 */
    оформлениеЗаявокНаРасходованиеДСПоВыставленнымАктам() {
        super.оформлениеЗаявокНаРасходованиеДСПоВыставленнымАктам()
    }
    /** 4 */
    согласованиеЗаявокНаРасходованиеДенежныхСредств() {
        super.согласованиеЗаявокНаРасходованиеДенежныхСредств()
    }
    /** 5 */
    

}