import { ProductService } from './product.service'


/** Бренд менеджеры, продукт группа
 * Артем Чумак Бренд-менеджер AVISTA, Газпром, G-Energy, Тосол-Синтез
 */
export class АртемЧумак extends ProductService {

    /** подготовить заказ поставщику
     * AVISTA, Газпром, G-Energy, Тосол-Синтез
     */
    подготовитьЗаказПоставщику() {
        return super.подготовитьЗаказПоставщику()
    }
    /** передать заказ поставщику Лекомцеву */
    передатьЗаказПоставщику(ExcelЗаказПоставщику: any) {
        super.передатьЗаказПоставщику(ExcelЗаказПоставщику)
    }
}