/** Группа маркетинга
 * Елена Колосова Маркетолог
 * Управление сайтом
 */

import { SITE } from "src/_commons/services/site/site.service";

export class MARKETING {

    constructor(
        site: SITE
    ) {

    }

    /** Управление новостями
     * Как уволился маркетолог сайтом никто не занимается и ничего не делает
     */
    разместитьНовостьНаСайте(site: any, news: any) {
    }
    /** Управление новостями
     * Как уволился маркетолог сайтом никто не занимается и ничего не делает
     */
    разместитьБанерНаСайте(site: any, baner: any) {
    }
}