


/** 1с 8  */


export class Программа1сБухБониксРф {
    private журналы: {
        ПоступлениеТоваровУслуг: ЖурналПоступленияТоваров,
        РеализацияТоваров: ЖурналРеализацииТоваров,

    }
    private справочники: {
        справочникКонтрагенты: СправочникКонтрагенты
        СправочникНоменклатура: СправочникНоменклатура,

    }
    private обработки: {
        ИмпортДокументов: ОбработкаИмпортДокументов
    }
    private отчеты: {}
    //***********************************Функционал********************************** */

    /** Ручное создание заказа поставщику createSupplierOrder*/
    импортироватьДокументы(документы: any) {
        return this.обработки.ИмпортДокументов.импортироватьДокументы(документы)
    }


}
//***********************************parents class********************************** */

class Журнал1с<T> {
    создать() { return {} as T }
    поиск() { return {} as T }
    пометитьНаУдаление() { return {} as T }
}
class Документ1с {
    /** Создание печатной формы Заказа поставщику  */
    вывестиНаПечать() { }
    провести() { return this }
    записать() { return this }
    изменить() { return this }
    ввестиНаОсновании() { }
    заполнитьПоДаннымОбработки(obrabota: any) { return this }
}
class Справочник1с<T> {
    изменить() { return this }
    создать() { return {} as T }
}
class Отчеты1с {
    сформировать() { }
}
//*********************************Справочники************************************ */

/** справочник контрагенты */
class СправочникКонтрагенты extends Справочник1с<Контрагент> {
    вывестиИнформациюОПереданныхТоварах() { }
}
class Контрагент { }

/** справочник СправочникНоменклатура */
class СправочникНоменклатура extends Справочник1с<Номенклатура> {
}
class Номенклатура { }

//*********************************Журналы документов************************************ */

/** ЖурналПоступленияТоваров */
class ЖурналПоступленияТоваров extends Журнал1с<ДокументПоступленияТоваров> { }
/** ДокументПоступленияТоваров*/
class ДокументПоступленияТоваров extends Документ1с { }


/** ЖурналРеализацииТоваров */
class ЖурналРеализацииТоваров extends Журнал1с<ДокументРеализацииТоваров> { }
/** ДокументРеализацииТоваров*/
class ДокументРеализацииТоваров extends Документ1с { }



//*********************************Отчеты************************************ */



//********************************Обработки************************************* */


/** обработка импорт выписки */
class ОбработкаИмпортДокументов {
    импортироватьДокументы(docs: any) { }
}



